src/test/resources/cdataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:skl:tjanst1:rivtabp20">
   <soapenv:Header>
      <add:To>vp-test-producer</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:getProductDetailElem>
         <!--Optional:-->
         <productId>RW456<![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><int:test/></soapenv:Body></soapenv:Envelope>]]></productId>
      </urn:getProductDetailElem>
   </soapenv:Body>
</soapenv:Envelope>